Revit 2027 API
RebarSplice.GetRebarSpliceGeometry Method
 Gets the RebarSpliceGeometry.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarSpliceGeometry GetRebarSpliceGeometry()
Public Function GetRebarSpliceGeometry As RebarSpliceGeometry
public:
RebarSpliceGeometry^ GetRebarSpliceGeometry()
member GetRebarSpliceGeometry : unit -> RebarSpliceGeometry
Return Value
RebarSpliceGeometry
 Returns the RebarSpliceGeometry.
See Also
Reference
RebarSplice Class
Autodesk.Revit.DB.Structure Namespace